{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer Plugin"
					},
					"Translation":
					{
						"Text": "EasyBatchRenamer Plugin"
					},
					"Key": "EasyBatchRenamer"
				}
			]
		},
		{
			"Namespace": "FEasyBatchRenamerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer"
					},
					"Translation":
					{
						"Text": "EasyBatchRenamer"
					},
					"Key": "FEasyBatchRenamerTabTitle"
				}
			]
		},
		{
			"Namespace": "SRenamerWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Actor"
					},
					"Translation":
					{
						"Text": "Actor"
					},
					"Key": "ItemType_Actor"
				},
				{
					"Source":
					{
						"Text": "Add prefix..."
					},
					"Translation":
					{
						"Text": "Add prefix..."
					},
					"Key": "PrefixTextHint"
				},
				{
					"Source":
					{
						"Text": "Add suffix..."
					},
					"Translation":
					{
						"Text": "Add suffix..."
					},
					"Key": "SuffixTextHint"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "Apply Rename"
					},
					"Key": "ApplyRenameTransaction"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "Apply Rename"
					},
					"Key": "ApplyRenameButton"
				},
				{
					"Source":
					{
						"Text": "Asset"
					},
					"Translation":
					{
						"Text": "Asset"
					},
					"Key": "ItemType_Asset"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Failed"
					},
					"Translation":
					{
						"Text": "Batch Rename Failed"
					},
					"Key": "RenameFailed"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Info"
					},
					"Translation":
					{
						"Text": "Batch Rename Info"
					},
					"Key": "RenameNoChange"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Partial Success"
					},
					"Translation":
					{
						"Text": "Batch Rename Partial Success"
					},
					"Key": "RenamePartialSuccess"
				},
				{
					"Source":
					{
						"Text": "Batch rename operation was canceled. Some items might not have been renamed."
					},
					"Translation":
					{
						"Text": "Batch rename operation was canceled. Some items might not have been renamed."
					},
					"Key": "RenameCanceled"
				},
				{
					"Source":
					{
						"Text": "Case Change:"
					},
					"Translation":
					{
						"Text": "Case Change:"
					},
					"Key": "CaseChangeLabel"
				},
				{
					"Source":
					{
						"Text": "Enable Regex:"
					},
					"Translation":
					{
						"Text": "Enable Regex:"
					},
					"Key": "EnableRegexLabel"
				},
				{
					"Source":
					{
						"Text": "Failed to rename {0} items. See log for details."
					},
					"Translation":
					{
						"Text": "Failed to rename {0} items. See log for details."
					},
					"Key": "RenameFailedFormat"
				},
				{
					"Source":
					{
						"Text": "Find Text:"
					},
					"Translation":
					{
						"Text": "Find Text:"
					},
					"Key": "FindTextLabel"
				},
				{
					"Source":
					{
						"Text": "Hint: English names are recommended."
					},
					"Translation":
					{
						"Text": "Hint: English names are recommended."
					},
					"Key": "RenameHint"
				},
				{
					"Source":
					{
						"Text": "Manual Name"
					},
					"Translation":
					{
						"Text": "Manual Name"
					},
					"Key": "ManualNameColumn"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "No Change"
					},
					"Key": "CaseChange_NoChange_Current"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "No Change"
					},
					"Key": "CaseChange_NoChange"
				},
				{
					"Source":
					{
						"Text": "No items needed renaming (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "No items needed renaming (names might be unchanged or no items selected)."
					},
					"Key": "NoRenameNeeded"
				},
				{
					"Source":
					{
						"Text": "No items were renamed (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "No items were renamed (names might be unchanged or no items selected)."
					},
					"Key": "RenameNoChangeMessage"
				},
				{
					"Source":
					{
						"Text": "Original Name"
					},
					"Translation":
					{
						"Text": "Original Name"
					},
					"Key": "OriginalNameColumn"
				},
				{
					"Source":
					{
						"Text": "Padding Digits:"
					},
					"Translation":
					{
						"Text": "Padding Digits:"
					},
					"Key": "PaddingDigitsLabel"
				},
				{
					"Source":
					{
						"Text": "Please select assets in the Content Browser or actors in the Outliner to begin batch renaming."
					},
					"Translation":
					{
						"Text": "Please select assets in the Content Browser or actors in the Outliner to begin batch renaming."
					},
					"Key": "NoSelectionMessage"
				},
				{
					"Source":
					{
						"Text": "Prefix:"
					},
					"Translation":
					{
						"Text": "Prefix:"
					},
					"Key": "PrefixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Preview Name"
					},
					"Translation":
					{
						"Text": "Preview Name"
					},
					"Key": "PreviewNameColumn"
				},
				{
					"Source":
					{
						"Text": "Processing Actors..."
					},
					"Translation":
					{
						"Text": "Processing Actors..."
					},
					"Key": "ProcessingActors"
				},
				{
					"Source":
					{
						"Text": "Processing Assets..."
					},
					"Translation":
					{
						"Text": "Processing Assets..."
					},
					"Key": "ProcessingAssets"
				},
				{
					"Source":
					{
						"Text": "Regex pattern to find (e.g., '^(BP_)')"
					},
					"Translation":
					{
						"Text": "Regex pattern to find (e.g., '^(BP_)')"
					},
					"Key": "RegexFindTextHint"
				},
				{
					"Source":
					{
						"Text": "Renamed {0} items. Failed to rename {1} items."
					},
					"Translation":
					{
						"Text": "Renamed {0} items. Failed to rename {1} items."
					},
					"Key": "RenamePartialSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Renaming Assets and Actors..."
					},
					"Translation":
					{
						"Text": "Renaming Assets and Actors..."
					},
					"Key": "RenamingAssetsAndActors"
				},
				{
					"Source":
					{
						"Text": "Replace With:"
					},
					"Translation":
					{
						"Text": "Replace With:"
					},
					"Key": "ReplaceTextLabel"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Lower"
					},
					"Translation":
					{
						"Text": "Replaced Part To Lower"
					},
					"Key": "CaseChange_ReplacedToLower"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Upper"
					},
					"Translation":
					{
						"Text": "Replaced Part To Upper"
					},
					"Key": "CaseChange_ReplacedToUpper"
				},
				{
					"Source":
					{
						"Text": "Reset Rules"
					},
					"Translation":
					{
						"Text": "Reset Rules"
					},
					"Key": "ResetRulesButton"
				},
				{
					"Source":
					{
						"Text": "Start Number:"
					},
					"Translation":
					{
						"Text": "Start Number:"
					},
					"Key": "StartNumberLabel"
				},
				{
					"Source":
					{
						"Text": "Successfully renamed {0} items."
					},
					"Translation":
					{
						"Text": "Successfully renamed {0} items."
					},
					"Key": "RenameSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Suffix:"
					},
					"Translation":
					{
						"Text": "Suffix:"
					},
					"Key": "SuffixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Text to find..."
					},
					"Translation":
					{
						"Text": "Text to find..."
					},
					"Key": "FindTextHint"
				},
				{
					"Source":
					{
						"Text": "Text to replace with..."
					},
					"Translation":
					{
						"Text": "Text to replace with..."
					},
					"Key": "ReplaceTextHint"
				},
				{
					"Source":
					{
						"Text": "Type"
					},
					"Translation":
					{
						"Text": "Type"
					},
					"Key": "TypeColumn"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "Unknown"
					},
					"Key": "CaseChange_Unknown_Current"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "Unknown"
					},
					"Key": "CaseChange_Unknown"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "Unknown"
					},
					"Key": "ItemType_Unknown"
				},
				{
					"Source":
					{
						"Text": "Use Numbering:"
					},
					"Translation":
					{
						"Text": "Use Numbering:"
					},
					"Key": "NumberingLabel"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "Whole Name To Lower"
					},
					"Key": "CaseChange_ToLower_Current"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "Whole Name To Lower"
					},
					"Key": "CaseChange_ToLower"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "Whole Name To Upper"
					},
					"Key": "CaseChange_ToUpper_Current"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "Whole Name To Upper"
					},
					"Key": "CaseChange_ToUpper"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FEasyBatchRenamerModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Bring up EasyBatchRenamer window"
							},
							"Translation":
							{
								"Text": "Bring up EasyBatchRenamer window"
							},
							"Key": "OpenPluginWindow_ToolTip"
						},
						{
							"Source":
							{
								"Text": "EasyBatchRenamer"
							},
							"Translation":
							{
								"Text": "EasyBatchRenamer"
							},
							"Key": "OpenPluginWindow"
						}
					]
				}
			]
		}
	]
}